const sqlite3 = require('sqlite3').verbose();

const DBSOURCE = 'db.sqlite';

const db = new sqlite3.Database(DBSOURCE, (err) => {
  if (!err) {
    console.log('Connected to the SQLite database.');

    db.run(`CREATE TABLE poi (
      id INTEGER PRIMARY KEY AUTOINCREMENT,
      name text,
      coordinates text
    )`,
    (err) => {
      if (!err) {
        var insert = 'INSERT INTO poi (name, coordinates) VALUES (?,?)';
        db.run(insert, ['Арка главного входа', '[37.637628,55.826301]']);
        db.run(insert, ['Павильон №1', '[37.63367888095079,55.82877916578044]']);
        db.run(insert, ['Робостанция', '[37.63140970759194,55.828748953823386]']);
        db.run(insert, ['Космос', '[37.622730023711476,55.832347584252105]']);
        db.run(insert, ['Техноград', '[37.63197907011364,55.83503450975778]']);
        db.run(insert, ['Центр «Космонавтика и авиация»', '[37.621533838531114,55.835340375004584]']);
        db.run(insert, ['Центр современных технологий', '[37.61864778163141,55.83505055815282]']);
        db.run(insert, ['Нефтеград', '[37.62019541623297,55.83381126408427]']);
        db.run(insert, ['Россия - моя история', '[37.62635108592215,55.834262039903564]']);
        db.run(insert, ['Макет ракеты-носителя «Восток»', '[37.62304660441573,55.83442506553905]']);
        db.run(insert, ['Музей Гаража особого назначения ФСО России', '[37.621313897392056,55.837104323791074]']);
        db.run(insert, ['Музей городского хозяйства Москвы', '[37.62959119441177,55.828804812976195]']);
        db.run(insert, ['Павильон Умный город', '[37.630874,55.833999]']);
        db.run(insert, ['Макет Москвы', '[37.62999423544301,55.83438694214604]']);
        db.run(insert, ['Музей Транспорта Москвы', '[37.62150504391071,55.83434769511445]']);
        db.run(insert, ['Солнце Москвы', '[37.626548,55.826726]']);
        db.run(insert, ['Бельведер', '[37.618038,55.830007]']);
        db.run(insert, ['Москвариум', '[37.618807,55.832931]']);
        db.run(insert, ['Свадьба соек', '[37.625707,55.837995]']);
        db.run(insert, ['Дом бабочек', '[37.630811,55.832955]']);
        db.run(insert, ['Лаборатория мороженого', '[37.631572,55.833505]']);
        db.run(insert, ['Музей славянской письменности', '[37.627214,55.832648]']);
        db.run(insert, ['Павильон Книги', '[37.61993,55.830122]']);
        db.run(insert, ['Южный розарий', '[37.633041,55.827795]']);
        db.run(insert, ['Театр сказок', '[37.628348,55.829057]']);
        db.run(insert, ['СоюзМультПарк', '[37.626905,55.827657]']);
        db.run(insert, ['Додолэнд', '[37.632886,55.833266]']);
      }
    });

    db.run(`CREATE TABLE history (
      id INTEGER PRIMARY KEY AUTOINCREMENT,
      ids text,
      distance text,
      duration text
    )`,
    (err) => {});
  } else {
    console.error(err.message);
    throw err;
  }
});


module.exports = db
